{
  "aoa": [
    "What is the mathematical background required for algorithm analysis?",
"What is the significance of performance analysis in algorithms?",
"Define space complexity and time complexity in algorithm analysis.",
"Explain Big-Oh, Omega Theta notations in algorithm analysis.",
"What is the complexity class and what are the definitions of P, NP, NP-Hard, and NP-Complete?",
"How is selection sort analyzed?",
"How is insertion sort analyzed?",
"What is the substitution method in recurrence analysis?",
"What is the recursion tree method in recurrence analysis?",
"What is the Master method in recurrence analysis?",
"What is the Divide and Conquer approach?",
"How is Merge sort analyzed?",
"How is Quick sort analyzed?",
"How is the finding minimum and maximum algorithms analyzed?",
"How is Binary search analyzed?",
"What is the Greedy method approach?",
"What is the general method used in the Greedy approach?",
"What is Dijkstra's algorithm?",
"What is the Single source shortest path problem?",
"How is the Fractional Knapsack problem solved using the Greedy approach?",
"What is the Job sequencing problem with deadlines?",
"How are Minimum cost spanning trees analyzed using the Greedy approach?",
"What are Kruskal and Prim's algorithms?",
"What is the Dynamic Programming approach?",
"What is the general method used in the Dynamic Programming approach?",
"What are multistage graphs?",
"What is the Bellman Ford algorithm?",
"What is the All pair shortest path problem?",
"What is the Floyd Warshall algorithm?",
"What is the Assembly-line scheduling problem?",
"What is the 0/1 Knapsack problem?",
"What is the Travelling Salesperson problem?",
"What is the Longest common subsequence problem?",
"What is the Backtracking method?",
"What is the N-queen problem?",
"What is the Sum of subsets problem?",
"What is the Graph coloring problem?",
"What is the Branch and Bound method?",
"What is the 15 Puzzle problem?",
"What are String Matching algorithms?",
"What is the Naïve string-matching algorithm?",
"What is the Rabin Karp algorithm?",
"What is the Knuth-Morris-Pratt algorithm?"
  ],
  "os": [
    "What are the objectives, functions and evolution of an operating system?",
"What are the different types of operating system structures?",
"What is the Linux kernel and what are shell and system calls?",
"What is a process and what are its different states?",
"What is a Process Control Block?",
"What are the different types of scheduling algorithms?",
"What is preemptive and non-preemptive scheduling?",
"What are threads and what is the concept of multithreading?",
"What are the principles of concurrency?",
"What is Inter-Process Communication and Process Synchronization?",
"What is mutual exclusion and why is it required?",
"What is the hardware and operating system support for mutual exclusion?",
"What is the producer and consumer problem?",
"What are the principles of deadlock and what are the conditions for a deadlock?",
"What are the resource allocation graphs?",
"What is deadlock prevention and what is the Banker's Algorithm?",
"What is deadlock avoidance?",
"What is deadlock detection and recovery?",
"What is the dining philosophers problem?",
"What are the requirements for memory management?",
"What are the different types of memory partitioning?",
"What are the different memory allocation strategies?",
"What is paging and segmentation?",
"What is TLB?",
"What is virtual memory and what is demand paging?",
"What are the different page replacement strategies?",
"What is thrashing?",
"What is file management?",
"What is file organization and access?",
"What are file directories?",
"What is file sharing?",
"What are I/O devices?",
"What is the organization of the I/O function?",
"What is disk organization?",
"What is disk scheduling?",
"What are the different disk scheduling algorithms?"
  ],
  "dbms": [
   "What are the characteristics of databases?",
"What is the difference between a file system and a database system?",
"What is data abstraction and data independence?",
"What is DBMS system architecture?",
"What is a Database Administrator?",
"What is the Entity-Relationship (ER) Model?",
"What are the different types of entity sets?",
"What are the different types of attributes?",
"What are the different types of keys?",
"What are the different types of relationship constraints?",
"What is the Extended Entity-Relationship (EER) Model?",
"What is Generalization in the EER Model?",
"What is Specialization in the EER Model?",
"What is Aggregation in the EER Model?",
"What is the Relational Model?",
"What is a relational schema?",
"What is the concept of keys in the Relational Model?",
"How is the ER and EER Model mapped to the Relational Model?",
"What are the different operators in Relational Algebra?",
"What are Relational Algebra queries?",
"What is SQL?",
"What are Data Definition Commands in SQL?",
"What are Integrity constraints in SQL?",
"What are Data Manipulation commands in SQL?",
"What are Data Control commands in SQL?",
"What are Set and string operations in SQL?",
"What are aggregate function-group by, having in SQL?",
"What are Views in SQL?",
"What are joins in SQL?",
"What are Nested and complex queries in SQL?",
"What are Triggers in SQL?",
"What are the pitfalls in Relational-Database designs?",
"What is the concept of normalization?",
"What are Function Dependencies?",
"What is First Normal Form?",
"What is Second Normal Form?",
"What is Third Normal Form?",
"What is Boyce-Codd Normal Form?",
"What is the Transaction concept?",
"What are Transaction states?",
"What are the ACID properties?",
"What are Transaction Control Commands?",
"What are Concurrent Executions?",
"What is Serializability?",
"What is Conflict and View in Serializability?",
"What are Lock-based protocols in Concurrency Control?",
"What are Timestamp-based protocols in Concurrency Control?",
"What is the Recovery System?",
"What is Log-based recovery?",
"What is Deadlock handling?"
  ]
}
